app/views/groups/show.html.erb

        <tbody class="t-body">
        <% @group.employees.each do |employee| %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."group_id" = $1  [["group_id", 2]]