app/controllers/employees_controller.rb

  def new
   @employee = Employee.new
   @group = Group.find(params[:group_id])
   @teams = Team.all
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"

  def create

    @employee = Employee.new(employees_params)
    @group = Group.find(params[:group_id])
    @employee.group = @group
     if @employee.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "employees" ("description", "group_id", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Sandra"], ["group_id", 4], ["team_id", 1], ["created_at", "2020-10-25 14:59:57.045059"], ["updated_at", "2020-10-25 14:59:57.045059"]]