app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT  "groups".* FROM "groups" ORDER BY "groups"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at", "photo") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Group 1w"], ["created_at", "2020-10-25 14:51:04.652825"], ["updated_at", "2020-10-25 14:51:04.652825"], ["photo", "erfr0q9xkfuqfu3wjdrp.jpeg"]]